[

    {
        "id": 1,
        "name": "Logitech G29 Driving Force Racing Wheel and Floor Pedals",
        "price": 79.00,
       "image": "https://www.slazzer.com/downloads/3c14b859-d8ac-11ef-a88e-b347d7ab6478/img00_prev_ui.png",
        "description": "Immersive Gaming Experience: Perfect for PlayStation 5, PS4, and PC gaming titles, the Driving Force simulates the feeling of driving a real car with precision steering and pressure-sensitive pedals. Premium Control: The Driving Force feedback racing wheel provides a detailed simulation of driving a real car, with helical gearing delivering smooth, quiet steering and a hand-stitched leather cover. Customizable Pedals: These pressure-sensitive nonlinear brake pedals provide a responsive, accurate braking feel on a sturdy base - with adjustable pedal faces for finer control. 900-Degree Rotation: Lock-to-lock rotation of the Driving Force means you can turn the wheel around two and a half times, hand over hand on wide turns - just like a real F1 race car. Up Your Game: Take your racing simulation to the next level with Driving Force accessories like the Driving Force Shifter or desk and rig mounts. The plastic parts in G29 Driving Force include 52 percent certified post-consumer recycled plastic. Certified carbon neutral. Total Wheel Control: Control wheel sensitivity, force feedback levels, and button customization via powerful G HUB Gaming Software for PC. Download at logitechG /downloads. Wheel Dimensions: Length: 10.24 in (260 mm), Height: 10.63 in (270 mm), Width: 10.94 in (278 mm), Weight without cables: 4.96 lb (2.25 Kg). Pedals Dimensions: Length: 16.87 in (428.5 mm), Height: 6.57 in (167 mm), Width: 12.24 in (311 mm), Weight without cables: 6.83 lb (3.1 Kg). Compatible with Windows 11, Windows 10, Windows 8.1, Windows 8, Windows 7.",
        "url": "https://www.amazon.com/Logitech-Dual-motor-Feedback-Responsive-PlayStation/dp/B00Z0UWWYC/ref=sr_1_2?dib=eyJ2IjoiMSJ9.J8w2gQU7z60xU_0aYhBRFgOu4N3ukJYUdauqwDDpmbFldZKCA5Fxyi6j-yhsOswDIKsJ8sBOQbxGkZpe-8le4khXKym34WAGPgNc6XogasapTECmbZZ-XhBx27_I2UHUjvGof3UYZL9U2LErl5_Go3Mnrnhv7Hgn4-v_oMyv4JEGEcz8X8DlhTtL8S8pwaM-zOINHKE0-qleEMnHV_aOgIIdej_MpTzq7wL_viiO0qybPr3lhWX3zZiDbZ5vRY8v2miaUqNZJvEeZOzOZemtyap9qTMl4hYphbpiAkB1BeDBcWol_DA_2c_mYkBaBrROXHl5D1KBR3JDpC0QNOnb-LcN1QulbvJlSdvSi4QWMhSXapr6CSTRHjtu-F1d1rdan_K2DvSfa85Bi5-lFQVKaxIRuQ2ORdmj7MYT_-8AHa8UvjBWVuyVZZPgBPeP-w5K.LF38ZBWHYi7jRTmTcaYTVdRFg2SkyehmJgAnWxrGamo&dib_tag=se&keywords=gaming%2Baccessories&qid=1737541482&sr=8-2&th=1"
      },
      {
        "id": 2,
        "name": "Turtle Beach Stealth 700 Gen 3 Wireless Multiplatform Amplified Gaming Headset ",
        "price": 159.00,
        "image": "https://www.slazzer.com/downloads/4c96871d-d8af-11ef-8c02-4fa7ce85451c/71oLbyE2CfL._AC_SX679__prev_ui.png",
        "description": "Ultimate Wireless Audio Experience: Enjoy simultaneous low-latency 2.4GHz wireless and Bluetooth 5.2 connectivity for seamless gaming across multiple platforms, with immersive spatial audio from 60mm Eclipse Dual Drivers. Superior Audio Control: Flip-to-Mute AI-based noise-canceling mic, advanced 10-band EQ via Swarm II app, and mappable controls let you tailor the audio experience. Built-in EQ modes and Superhuman Hearing further enhance gameplay. Unrivaled Comfort and Design: Memory foam cushions with glasses-friendly technology, a lay-flat steel-reinforced frame, and an adjustable headband provide exceptional comfort during extended gaming sessions. Unbeatable Battery Life: Experience up to 80 hours of uninterrupted gaming with the long-lasting battery, plus quick-charge capability for on-the-go convenience.",
        "url": "https://www.amazon.com/dp/B0DB9LQ7R5/ref=sspa_dk_detail_1?pd_rd_i=B0DB9LQ7R5&pd_rd_w=3CzCo&content-id=amzn1.sym.2283fd66-e1b9-4348-a035-8043f03d31b8&pf_rd_p=2283fd66-e1b9-4348-a035-8043f03d31b8&pf_rd_r=Y36Z9PDCW6FVCYJ406YS&pd_rd_wg=mkazZ&pd_rd_r=167acc17-202a-4cff-86b1-5ec3ad3df78b&s=pc&sp_csd=d2lkZ2V0TmFtZT1zcF9kZXRhaWxfdGhlbWF0aWM&th=1"
      },
      {
        "id": 3,
        "name": "PlayStation DualSense Edge Wireless Controller",
        "price": 199.00,
        "image": "https://www.slazzer.com/downloads/f510962b-d8b0-11ef-8c02-4fa7ce85451c/1b721c92-8148-46cc-825a-1b41b8928b14.c6d7ccefa1a2d4619aa31c642b71e160%20%281%29_prev_ui.png",
        "description": "Aim and move with precision by swapping in fresh stick modules* so you’re always playing with equipment that’s in great shape. Plus, three types of changeable stick caps help you stay comfortable in-game without sacrificing grip or stability. Mappable back buttons: The DualSense Edge wireless controller’s two swappable sets of back buttons can be configured to any other button input, so you’ve always got game-changing actions and essential controls at your fingertips. Adjustable trigger lengths: Manually set the travel distance of your left and right triggers for an optimal experience with whatever you’re playing. Fast-paced FPS? Set a shorter travel distance to shoot faster on the field. Competitive racer? Set a longer travel distance for precise throttle control on the track. Remappable buttons: Remap or even deactivate specific button inputs, so you can create a completely personalized control setup that’s ideal for the game at hand. Quick-swap control profiles: Once you’ve found your ideal control settings, you can save them to unique profiles and swap between them on-the-fly, so your favourite configurations are always ready when you are.",
        "url": "https://www.amazon.com/PlayStation-DualSense-Edge-Wireless-Controller-5/dp/B0BSYFB99D/ref=pd_bxgy_thbs_d_sccl_1/131-7736716-5238021?pd_rd_w=ySaVk&content-id=amzn1.sym.53b72ea0-a439-4b9d-9319-7c2ee5c88973&pf_rd_p=53b72ea0-a439-4b9d-9319-7c2ee5c88973&pf_rd_r=S8BC80EHV22BM3BQ497S&pd_rd_wg=huNez&pd_rd_r=6317a137-b5b7-40c0-ba90-f5e602d83b30&pd_rd_i=B0BSYFB99D&th=1"
      },
      {
        "id": 4,
        "name": "Sceptre Curved 24-inch Gaming Monitor 1080p",
        "price": 96.00,
        "image": "https://www.slazzer.com/downloads/83b74b67-d8b2-11ef-8c02-4fa7ce85451c/71P0M7tKjYL._AC_SX425__prev_ui.png",
        "description": "24-Inch Curved VA Display: Experience an immersive viewing experience with the 1800R curved panel, 1920 x 1080 Full HD resolution, and a 16:9 aspect ratio. Responsive Performance: Enjoy smooth visuals with a 75Hz refresh rate and 5ms response time, complemented by Adaptive Sync (FreeSync) technology. Connectivity Options: Connect your devices via HDMI, VGA, and PC audio input ports, with a total of 2 HDMI ports available. Adjustable Viewing: The monitor features a VESA wall mount compatibility, allowing you to customize the viewing angle and position.",
        "url": "https://www.amazon.com/Sceptre-Curved-Monitor-Speakers-C248W-1920RN/dp/B07KXSR99Y/ref=sr_1_5?crid=1R3DFF3LO16ZE&dib=eyJ2IjoiMSJ9.EP7tbRJ1MEadMHhat-Rt-XJdUkl0no6lcnRc-WDt3lb75t94C01azAZIhh31NMqy5rLimSSjqq7k_9QXVmH2Uun8LZG-ZLPmGgnQCvY1a1rJHhh2MzNS2J-qdLjsVXcCLwqDefSohrdNBjvdF-zOuZ9_BpGB-nKI0eOLrPEa3wixuBnjg2IJRLsbjGtznb59VVZrhy9LmQpepphnkpygMRFLI6GlrNgtcP_jjMmjvzo.XXu0IsZWfi6SVxuQheCWhgk_-Y0gWO9Hgap7n0isI4s&dib_tag=se&keywords=gaming%2Bmonitor&qid=1737544580&sprefix=gaming%2B%2Caps%2C505&sr=8-5&th=1"
      },
      
      {
        "id": 5,
        "name": "MoNiBloom Gaming Chair",
        "price": 120.00,
        "image": null,
        "description": "Ergonomic Design: This gaming chair features an ergonomic seat shell with a gentle curvature and firm lumbar support, promoting a healthy sitting posture and relieving back strain during extended gaming sessions. Adjustable Comfort: The medium-firm upholstery foam evenly distributes weight and relieves pressure, while the seatback and footrest can recline up to 180 degrees, providing comprehensive support for your head, shoulders, back, and legs. Durable and Breathable: Constructed with faux leather that is scratch-resistant, fade-resistant, and features breathable holes to keep you cool, ensuring long-lasting use and comfort. Practical Details: This chair is made by MoNiBloom, requires assembly, has a swivel base, supports up to 300 lbs, and comes with a warranty .",
        "url": "https://www.amazon.com/MoNiBloom-Footrest-Headrest-Adjustable-Computer/dp/B0BMZ28V18/ref=sr_1_8?crid=3RWHPCWPZ59GK&dib=eyJ2IjoiMSJ9.35G5T9QZtr0kyUCougKbqPLVe4Jh_YUncMWwrMEk5gkrUODpGgdC5ue83JtGi2JFFSA2yzRPdLom_2tHkdZwdCAmZPwuLjmNOSY-0uGJbRlM7amb2LayHIFA6RYNhu1RGGO0yhun4eccGNUOXIQwfigl_TBSQOkelRjTvg49p7VVoHbshUE2Y8Z4NAZOeCOiPytnnYHpfBENlYevpf1fD7WMLxm-zWkWl3NLRvimuvNBXQFiTYZoxx0R4lZLKYgfQxemKKwERbgYf-Cpkr82w7QRuy9Zp5cesvYDFSWzb-k1pLJAPPM1Av5EdEZ_TedvYtO2-JoDrD2TeHrqQ7fd4oUfnLcBcq0NogZbC2YeajzTVKCPhHrqXOqaP3vEgt27p7CTYnAQ72_I3wsbth50TlvB7RWRJ69MSE_lZ02zMfACKLFvy3mM_3xEYExW56mk.2Sm7tC2GWfFJL-MeThg2s-yVWDZXFeWDyeunzJ04GRA&dib_tag=se&keywords=gaming%2Bchair&qid=1737544909&sprefix=gaming%2Bcha%2Caps%2C647&sr=8-8&th=1"
      },
      {
        "id": 6,
        "name": "Beats Studio Buds - True Wireless Noise Cancelling Earbuds",
        "price": 99.00,
        "image": null,
        "description": "Premium Sound Quality: Custom acoustic platform delivers powerful, balanced sound through advanced drivers and audio engineering. Versatile Listening Modes: Active Noise Cancelling mode blocks outside noise for immersive audio, while Transparency mode lets you hear your surroundings. Seamless Connectivity: Class 1 Bluetooth technology provides extended range and fewer dropouts, compatible with Apple and Android devices. All-Day Battery Life: Up to 8 hours of listening time per charge, plus 24 hours of combined playback with the charging case.",
        "url": "https://www.amazon.com/Beats-Studio-Cancelling-Earbuds-Built-Bluetooth-Headphones/dp/B096SRYXMP/ref=sr_1_7?crid=1FXNA1D73GW7J&dib=eyJ2IjoiMSJ9.i20EQmR1dTvL9NY1orx4TNIyNQEiTHzKEjCGFL5-JkZ0aYUV5X_nAfkK4hI6Qq08WG9Q7ZiuUmaM-BFxBx20nXbfyUnbQ27GqIsA4L0CnbafSiJKDWomJ3Z--8NqJUyXKxuORVIkgFAr0B9X1FUJ6z9rXSp5vMJNKn0GMGlBy5eTaP-FJmSaGDIHDGU4RB52n8QsUXRGdTHYF1aTQNU8Kn9No1qvKJ87HLk39vRCVVI.juy4gqcrtFyv2MCwQjaKOExDLhWiKKFdccGY4DCpU-s&dib_tag=se&keywords=airpods&qid=1737547785&sprefix=air%2Caps%2C697&sr=8-7"
      }
      
      
      
      
      
      
]
